app/views/artists/_artist.html.erb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = 44
---

        <%= artist.artworks.map(&:title).join(", ") %>