app/views/artworks/_artwork.html.erb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = 1 LIMIT 1
---
          <div class="artwork-centre">
            <h4><strong>Artist:</strong></h4> <h5><%= artwork.artist.first_name %> <%= artwork.artist.last_name %></h5>