app/views/artworks/_form.html.erb

    <br>
    <%= f.association :artist, collection: Artist.all, label_method: :first_name %>
---
SELECT "artists".* FROM "artists"