app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("picture", "first_name", "last_name", "date_of_birth", "created_at", "updated_at") VALUES ('', 'Maxime', 'Basset', '2020-06-20', '2025-02-20 16:14:04.873705', '2025-02-20 16:14:04.873705') RETURNING "id"

  def update
    respond_to do |format|
      if @artist.update(artist_params)
---
UPDATE "artists" SET "picture" = 'https://imgs.search.brave.com/uazuY3jcCbxzlrvfTWFqwBBPP-R-fRAEGj6KsRJTFGM/rs:fit:500:0:0:0/g:ce/aHR0cHM6Ly9jb250/ZW50LmltYWdlcmVz/aXplci5jb20vaW1h/Z2VzL21lbWVzL1Np/Z21hLU1hbGUtbWVt/ZS02LmpwZw', "updated_at" = '2025-02-21 15:21:02.673813' WHERE "artists"."id" = 1

  def destroy
    @artist.destroy!
---
DELETE FROM "artists" WHERE "artists"."id" = 1

    def set_artist
      @artist = Artist.find(params.expect(:id))
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = 1 LIMIT 1