app/controllers/artworks_controller.rb

  def create
    @artwork = Artwork.new(artwork_params)

    respond_to do |format|
      if @artwork.save
---
INSERT INTO "artworks" ("title", "image", "artist_id", "creation_date", "history", "created_at", "updated_at") VALUES ('dede', '', 44, '2025-02-21', '', '2025-02-21 15:58:15.702438', '2025-02-21 15:58:15.702438') RETURNING "id"

  def update
    respond_to do |format|
      if @artwork.update(artwork_params)
---
UPDATE "artworks" SET "image" = 'dedzzzdez', "updated_at" = '2025-02-21 16:08:23.313821' WHERE "artworks"."id" = 2

    def set_artwork
      @artwork = Artwork.find(params.expect(:id))
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = 1 LIMIT 1